      * Copybook: HTTP Response Structure
      * Used by: http-client-curl.cob (LINKAGE),
      *          stregsystem-api.cob (WS)
       01  http-response-status PIC S9(9) COMP-5.