      ******************************************************************
      * Author: Naitsabot
      * Purpose: JSON encoding and decoding
      * Description:
      *     Helper functions for decoding and encoding JSON formatted
      *     strings
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. JSON-HELPER.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION ALL INTRINSIC.

       DATA DIVISION.
       PROCEDURE DIVISION
       MAIN-LOGIC.
           GOBACK.

       ENCODE-JSON.
           .

       DECODE-JSON.
           .
